tutorials/modules/incompressibleFluid/ductSecondaryFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0    0       0)
    (0.1  0       0)
    (0    0.0525  0)
    (0.1  0.0525  0)

    (0    0       0.001)
    (0.1  0       0.001)
    (0    0.0525  0.001)
    (0.1  0.0525  0.001)
);

blocks
(
    hex (0 1 3 2 4 5 7 6)
    (134 70 1)
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 1 3 2)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (4 6 7 5)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }

    leftWall
    {
        type wall;
        faces
        (
            (0 2 6 4)
        );
    }

    topSymmetry
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    rightSymmetry
    {
        type symmetryPlane;
        faces
        (
            (1 5 7 3)
        );
    }
);


// ************************************************************************* //
